eteodun/ESP32_Smart_Thermostat_3_Zones/ESP32_3_Zones.cpp
#include <Arduino.h>
//Ver 1.3, problem with trv valves. updtae control heat
//  Update TRV status confirmation if heating mode is on or off.
//Ver 1.4:
//  Update condition to turn off heating  if mqtt or wifi is down.
//Ver 1.5 Update times running and 
// Version 1 6 desktop
// added from laptop
//  branch 1 
// Implemented hysteresis all
// implemented from desktop 11 47
//#include <DNSServer.h>
//#include <ESP8266HTTPUpdateServer.h>
#include <ArduinoJson.h>
#include <math.h>
#include <SPI.h>
#include <DHT.h>

#ifdef ESP32
#include <WiFi.h>
#include <AsyncTCP.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#endif
#include <ESPAsyncWebServer.h>
//#include <AsyncEventSource.h>
#include <ESPAsyncWiFiManager.h>

#include <ESPAsyncTCP.h>
#include <WiFiUdp.h>  //For OTA
#include <ArduinoOTA.h> //For OTA

#include <PubSubClient.h>
#include <Adafruit_HDC1000.h>
#include <Adafruit_Sensor.h>

//Define ESP hostname on network
const char* ServerName = "thermostat";   // define hostname device.  e.g. If name = "thermostat" use http://thermostat.local/
///Credentials for MQTT server
///#define mqtt_user "homeassistant"
///#define mqtt_password "rie9AiYei5oox1Uiwiejiepi8bai6ahv3kai6ahgei7Cuupoa4ietoufies9xaeh"
///#define mqtt_server "192.168.100.133"  //is 15
//
const char* sw_version = "1.6-0";
const char* model = "3 Zones with TRV Valves, internal sensor, histeresis";
const char* mqtt_user = "mqtt_user";
const char* mqtt_password = "QAzx.123";
//#define mqtt_server "vpsmqtt.tehnocyber.ro"  //is 15
//
const char* mqtt_server = "homeassistant.local";    // Hostname of Homeassitant 
IPAddress serverIP;    //For find  Hostname of Homeassitant  
///
//Define times 
unsigned long OVERTIME_RUNNING = 100;  // Time in minutes maximu time to running 
///Time for running heating 
unsigned long intervalRunningOn = 9;  // Time in minutes to run one cicle of heat
///Time for running brake 
unsigned long intervalRunningOff = 6; // Time in minutes to brake heating
// 
// Define LOOPs time
const unsigned long SAMPLE_LOOP_TIME1 = 5;   //time in seconds
const unsigned long SAMPLE_LOOP_TIME2 = 9;   //time in seconds
const unsigned long SAMPLE_LOOP_TIME3 = 11;  //time in seconds
const unsigned long SAMPLE_LOOP_TIME4 = 4;   //time in seconds
//
// Define time to take in consideration temperature
#define TIME_SENSOR 7    // time in seconds to confirm temperatures
//
// Define relays pins ESP32
///const byte   RelayPIN1 = T8;   // Relay heater room 1 
///const byte   RelayPIN2 = T7;   // Relay heater room 2
///const byte   RelayPIN3 = T6;   // Relay heater room 3
///const byte   RelayPINHeater = T5;   // Relay heater control
/////END relays pins
///const byte   PINWifi = T1;   // Relay heater control
///const byte   PINAlarm = T2;   // Relay heater control
///#define LED 16
// Define relays pins ESP8266
const byte   RelayPIN1 = D8;   // Relay heater room 1 
const byte   RelayPIN2 = D7;   // Relay heater room 2
const byte   RelayPIN3 = D6;   // Relay heater room 3
const byte   RelayPINHeater = D5;   // Relay heater control
//END relays pins
const byte   PINWifi = D1;   // Relay heater control
const byte   PINAlarm = D2;   // Relay heater control
#define LED 16
//
// Define DHT22 sensor
#define DHTPIN D4  //Define data pin for DHT sensor 
#define DHTTYPE DHT22   // DHT 22  (AM2302), AM2321
DHT dht(DHTPIN, DHTTYPE);
// END define DHT
//Definim timpi
//time sensor 1
unsigned long lowTempSensorTime1;
unsigned long lowlastReadTime1;  // Timestamp of the last time the analog input was read
//time sensor 2
unsigned long lowTempSensorTime2;
unsigned long lowlastReadTime2;  // Timestamp of the last time the analog input was read
//time sensor 3
unsigned long lowTempSensorTime3;
unsigned long lowlastReadTime3;  // Timestamp of the last time the analog input was read
// end time sensor
// time for high temp sensor 1
unsigned long highTempSensorTime1;
unsigned long highlastReadTime1;  // Timestamp of the last time the analog input was read
// time for high temp sensor 2
unsigned long highTempSensorTime2;
unsigned long highlastReadTime2;  // Timestamp of the last time the analog input was read
// time for high temp sensor 3
unsigned long highTempSensorTime3;
unsigned long highlastReadTime3;  // Timestamp of the last time the analog input was read

//Time to retry connect to mqtt server
unsigned long lastReconnectAttempt = 0; //Folosit in functia de reconectare MQTT. resetam timpul la 0
const unsigned long reconnectMQTTInterval = 5; //Intervalul între încercările de reconectare in secunde
//Loop time setting
unsigned long previousMillis1 = 0; //Folosit in loop. resetam timpul la 0
unsigned long previousMillis2 = 0; //Folosit in loop. resetam timpul la 0
unsigned long previousMillis3 = 0;
unsigned long previousMillis4 = 0;
unsigned long previousMillis5 = 0;

/// Overtime running millis
//unsigned long overRuningMillis = OVERTIME_RUNNING * 60 * 1000UL; //transformam in minute
unsigned long overRunningTime;
unsigned long overRunningLastReadTime;  // Timestamp of the last time the analog input was read
/// Running maxim time to heat or take a brake  
///Time for running heat
unsigned long previousMillis = 0;  //
//unsigned long intervalMillisOn = intervalRunningOn * 60 * 1000UL; //transformam in minute
///Time for running brake 
//unsigned long intervalMillisOff = intervalRunningOff * 60 * 1000UL; //transformam in minute
///

// define topics 
//Topics for  sensor name  on rooms
///Zone1
//Topic for sensor name 
const PROGMEM char* mqtt_topic_name_zone1 			      = "thermostat/zone1/name";
const PROGMEM char* mqtt_topic_temp_zone1 			      = "thermostat/zone1/temperature";
const PROGMEM char* mqtt_topic_target_temp_zone1 	    = "thermostat/zone1/target";
const PROGMEM char* mqtt_topic_TRV_status_zone1		    = "thermostat/zone1/availability/trv";
//const PROGMEM char* mqtt_topic_TRV_setting_zone1	  = "thermostat/zone1/TRV/set";  // Topic for TRV1
const PROGMEM char* mqtt_topic_TRV_setting_zone1	    = "thermostat/zone1/TRV/heating";  // Topic for TRV1
const PROGMEM char* mqtt_topic_maintenance_radiator_1 = "thermostat/zone1/maintenance/radiator";  	 // Topic for maintenance radiator1
const PROGMEM char* mqtt_topic_TRV_mode_zone1	    = "thermostat/zone1/status";  // Topic for TRV1 status confirmation
///Zone2
//Topic for sensor name 
const PROGMEM char* mqtt_topic_name_zone2 			      = "thermostat/zone2/name";
const PROGMEM char* mqtt_topic_temp_zone2 			      = "thermostat/zone2/temperature";
const PROGMEM char* mqtt_topic_target_temp_zone2 	    = "thermostat/zone2/target";
const PROGMEM char* mqtt_topic_TRV_status_zone2		    = "thermostat/zone2/availability/trv";
//const PROGMEM char* mqtt_topic_TRV_setting_zone2	    = "thermostat/zone2/TRV/set";  // Topic for TRV2
const PROGMEM char* mqtt_topic_TRV_setting_zone2	    = "thermostat/zone2/TRV/heating";  // Topic for TRV2
const PROGMEM char* mqtt_topic_maintenance_radiator_2 = "thermostat/zone2/maintenance/radiator";      // Topic for maintenance radiator_2
const PROGMEM char* mqtt_topic_TRV_mode_zone2	    = "thermostat/zone2/status";  // Topic for TRV2 status confirmation
///Zone3
//Topic for sensor name 
const PROGMEM char* mqtt_topic_name_zone3 			      = "thermostat/zone3/name";
const PROGMEM char* mqtt_topic_temp_zone3 			      = "thermostat/zone3/temperature";
const PROGMEM char* mqtt_topic_target_temp_zone3 	    = "thermostat/zone3/target";
const PROGMEM char* mqtt_topic_TRV_status_zone3		    = "thermostat/zone3/availability/trv";
//const PROGMEM char* mqtt_topic_TRV_setting_zone3	  = "thermostat/zone3/TRV/set"; 				 	// Topic for TRV3
const PROGMEM char* mqtt_topic_TRV_setting_zone3	    = "thermostat/zone3/TRV/heating"; 				 	// Topic for TRV3
const PROGMEM char* mqtt_topic_maintenance_radiator_3 = "thermostat/zone3/maintenance/radiator";   	// Topic for maintenance radiator_3
const PROGMEM char* mqtt_topic_TRV_mode_zone3	    = "thermostat/zone3/status";  // Topic for TRV3 status confirmation
// Define topics for boiler 
// Topic used at startup or reconnect ESP module
const PROGMEM char* MQTT_STARTUP_STATE 				    		= "thermostat/boiler/boot";
const PROGMEM char* MQTT_HVAC_MODE 							      = "thermostat/boiler/hvacmode";  			  			 // Topic for HVAC MODE ON or OFF
const PROGMEM char* MQTT_SENSOR_INTERNAL 				     	= "thermostat/boiler/temperature/internalTemp";
const PROGMEM char* MQTT_SENSOR_CORRECTION_INTERNAL		= "thermostat/boiler/correction_internal";    			 // Correction internal sensor
const PROGMEM char* MQTT_OVERRUNNING_TOPIC 					  = "thermostat/boiler/overruning/state";             	 // We send overrunning state to HomeAssistant
const PROGMEM char* MQTT_OVERRUNNING_RESET_TOPIC 			= "thermostat/boiler/maintenance/reset_overrunning";     // Topic to reset overruning state from HomeAssistant
const PROGMEM char* MQTT_HEATING_STATE 						    = "thermostat/boiler/heatingState"; 					 // Topic for ESP if heating or not 
const PROGMEM char* status_esp_keepalive 					    = "thermostat/boiler/status";   						 // Topic for send heartbeat to Homeassitant
const PROGMEM char* ESP_IP_TOPIC						          = "thermostat/boiler/ip";  								 //Publish ESP IP
const PROGMEM char* mqtt_topic_manual_heating				  = "thermostat/boiler/maintenance/manual_heating";   	 //  Topic for maintenance boiler
const PROGMEM char* mqtt_topic_maintenance            = "thermostat/boiler/maintenance/maintenance";  // Topic for maintenance
/////
const PROGMEM char* mqtt_boiler_overruning_time       = "thermostat/boiler/settings/overruning";  // Topic for maintenance
const PROGMEM char* mqtt_boiler_running_time          = "thermostat/boiler/settings/runningtime";  // Topic for maintenance
const PROGMEM char* mqtt_boiler_pause_time            = "thermostat/boiler/settings/pausetime";  // Topic for maintenance
/////// histerises 
const PROGMEM char* mqtt_boiler_histeresis_upper            = "thermostat/boiler/settings/histeresis_upper";  // Topic for histerises setting upper value

const PROGMEM char* mqtt_boiler_histeresis_down            = "thermostat/boiler/settings/histeresis_down";  // Topic for histerises for down value
///////
const PROGMEM char* MQTT_BRIDGE_STATE                 = "zigbee2mqtt/bridge/state";

// Define Booleans for status sensors 
bool TRV1 = false;
bool TRV2 = false;
bool TRV3 = false;
bool TRV1STATUS = false;
bool TRV2STATUS = false;
bool TRV3STATUS = false;
bool bridgeState = false;
// Define Booleans for maintenance
bool maintenance = false;
bool radiator_1 = false;
bool radiator_2 = false;
bool radiator_3 = false;
bool manual_heating = false;

// Define Boolean for HVAC mode 
bool hvacmode = false; // Used ig heating mode Is  On or Off
//
bool ON = true;  //Used for Radiator relay on or off
bool OFF = false; //Used for Radiator relay on or off
//
bool heatingActive = false;  //Used for heating state
bool pauseActive = false;   // Used for heating pause state
bool overrunning = false;  // Used for heating overrruning
//switch case
bool areAllTRVsOn = TRV1 && TRV2 && TRV3;
/// 
float  Temperature1, Temperature2, Temperature3;
float  Temperature1mqtt, Temperature2mqtt, Temperature3mqtt;
float TempInternal = 0;
///Target Temp variables 
float TargetTempRoom1 = 22.0;
float TargetTempRoom2 = 22.0;
float TargetTempRoom3 = 22.0;
float correction_internal = 0.0;
//
// Define histerises limit
float  histeresisup = 0.0;  // Grade of histeresis upper limit
//
float histeresisdown = 0.0; // Grade of histeresis lower limit
/// Define sensor names variables
String Senzor1_name = "";
String Senzor2_name = "";
String Senzor3_name = "";

