eteodun/ESP32_Smart_Thermostat_3_Zones/ESP32_3_Zones.cpp
String espip = "";
// Define relays state variables
String RelayState1          = "OFF";      // Current setting of the control/thermostat relay
String RelayState2          = "OFF";      // Current setting of the control/thermostat relay
String RelayState3          = "OFF";      // Current setting of the control/thermostat relay
String RelayHeaterState     = "OFF";      // Current setting of the control/thermostat relay
String TimerState           = "OFF";      // Current setting of the timer
String OverTime             = "OFF";      // Overtime running
// define variables for webpage 
String SytemAlarm           = "OFF";
String MQTT_CONNECT         = "OFF";
String SensorsConnected         = "ON";
/// Define actuating TRV VALVES 
const char TRVON[] = "{\"system_mode\": \"heat\"}";
const char TRVOFF[] = "{\"system_mode\": \"off\"}";
const char TRVTARGET[] = "{\"current_heating_setpoint\": \"28.0\"}";
///
 
///
String webpage              = "";    // Used for webpage  
AsyncWebServer server(80);
DNSServer dns;
AsyncWiFiManager wifiManager(&server,&dns);

WiFiClient espClient;  

PubSubClient client(espClient);  // Used to publish MQTT messages
static int restartNow = false;  // Defined to reboot ESP module
////String newHostname = "esp8266thermostat"; //Hostname on network
#define Refresh         true           // Set auto refresh page ON
#define noRefresh       false          // Set auto refresh page OFF

// setup HostName of device  . If name = "thermostat" use http://thermostat.local/
void SetupDeviceName(const char *DeviceName) {
  if (MDNS.begin(DeviceName)) { 
    Serial.println("mDNS responder started");
    Serial.print("Device name: ");
    Serial.println(DeviceName);
    MDNS.addService("n8i-mlp", "tcp", 23);
  }
  else
    Serial.println("Error setting up MDNS responder");
}
// Publish ESP IP to MQTT topic 
void publishIP() {  
    char ipMessage[30];
    sprintf(ipMessage, "IP: %s", WiFi.localIP().toString().c_str());
    client.publish(ESP_IP_TOPIC, ipMessage);
    //Serial.println("publishIP");
}
void subscribeToTopics() {
  // Abonarea la topic-uri după reconectare
  client.subscribe(mqtt_topic_name_zone1);
  client.subscribe(mqtt_topic_name_zone2);
  client.subscribe(mqtt_topic_name_zone3);

  client.subscribe(mqtt_topic_TRV_status_zone1);
  client.subscribe(mqtt_topic_TRV_status_zone2);
  client.subscribe(mqtt_topic_TRV_status_zone3);

  ///
  client.subscribe(mqtt_topic_temp_zone1);
  client.subscribe(mqtt_topic_temp_zone2);
  client.subscribe(mqtt_topic_temp_zone3);
 
  ///
  client.subscribe(mqtt_topic_target_temp_zone1);
  client.subscribe(mqtt_topic_target_temp_zone2);
  client.subscribe(mqtt_topic_target_temp_zone3);
  
  //
  client.subscribe(mqtt_topic_maintenance); 
  client.subscribe(mqtt_topic_maintenance_radiator_1);  
  client.subscribe(mqtt_topic_maintenance_radiator_2);  
  client.subscribe(mqtt_topic_maintenance_radiator_3);
  //
  client.subscribe(mqtt_topic_TRV_mode_zone1);
  client.subscribe(mqtt_topic_TRV_mode_zone2);
  client.subscribe(mqtt_topic_TRV_mode_zone3);
  //
  client.subscribe(mqtt_topic_TRV_setting_zone1);
  client.subscribe(mqtt_topic_TRV_setting_zone2);
  client.subscribe(mqtt_topic_TRV_setting_zone3);
  //boiler settings
  client.subscribe(mqtt_boiler_overruning_time);
  client.subscribe(mqtt_boiler_running_time);
  client.subscribe(mqtt_boiler_pause_time);
  client.subscribe(mqtt_boiler_histeresis_upper);
  client.subscribe(mqtt_boiler_histeresis_down);
  //
  client.subscribe(mqtt_topic_manual_heating);
  //
  client.subscribe(MQTT_HVAC_MODE);
  client.subscribe(MQTT_OVERRUNNING_RESET_TOPIC);
  client.subscribe(MQTT_BRIDGE_STATE);
  //
  client.subscribe(MQTT_SENSOR_CORRECTION_INTERNAL);
}
void reconnect() {  // Function to reconnect MQTT 
  if (!client.connected()){
    Temperature1 = 0;
    Temperature2 = 0;
    Temperature3 = 0;
    MQTT_CONNECT = "OFF";
  unsigned long currentMillis = millis();
  if (currentMillis - lastReconnectAttempt >= reconnectMQTTInterval * 1000) {   //incercam la 5 secunde sa ne reconectam la mqtt. nu am folosit while 
    lastReconnectAttempt = currentMillis;
    if (client.connect("thermostat", mqtt_user, mqtt_password)) {
      //Serial.println("MQTT_connected"); // pentru verificare
      MQTT_CONNECT = "ON";
      subscribeToTopics();  // We call function su subscribe topics
      client.publish(MQTT_STARTUP_STATE, String("started").c_str(), false);
      publishIP();
      if (WiFi.hostByName(mqtt_server, serverIP)) {
      Serial.print("IP address of HAS ");
      Serial.print(mqtt_server);
      Serial.print(": ");
      Serial.println(serverIP);
    } else {
      Serial.println("Failed to get IP address from DNS");
    }
    }
    else {
      ///daca nu se conecteaza, facem ce e mai jos
      Serial.print("Failed to connect MQTT");
      Serial.print(client.state());
      Serial.println("Reconnectin in 5 seconds");
      // Wait 5 seconds before retrying and again
      //delay(5000);
    }
   }
  }
}
void StartUp_ESP(){
  
  if ((Temperature1 == 0.00 && TRV1) ||
      (Temperature2 == 0.00 && TRV2) ||
      (Temperature3 == 0.00 && TRV3)) {
      client.publish(MQTT_STARTUP_STATE, String("started").c_str(), false);
      Serial.println("Am bootat: ");
  }
}

void checkSensor(){
  if (client.connected()){
    if (TRV1){
      Temperature1 = Temperature1mqtt;
      }
    else {
     Serial.println("TRV1: Offline");
     Temperature1 = 0;
    }
    if (TRV2){
      Temperature2 = Temperature2mqtt;
    }
    else {
     Serial.println("TRV2: Offline");
     Temperature2 = 0;
    }
    if (TRV3){
      Temperature3 = Temperature3mqtt;
      }
    else {
     Serial.println("TRV3: Offline");
     Temperature3 = 0;
    }
    if(!bridgeState){
     TRV1 =  false;
     TRV2 =  false;
     TRV3 =  false;
     Serial.println("Zigbee Device: Offline");
     SensorsConnected = "ON";
    }
    if(areAllTRVsOn){
      Serial.println("All sensors are up");
      SensorsConnected = "OFF";
    }
    else {
      SensorsConnected = "ON";
    }
  }
}

void updateTRVState(const char* topic,byte* payload, unsigned int length, bool& TRVState) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  DynamicJsonBuffer jsonBuffer;
  
  //Serial.print("Received payload: ");
  //Serial.println(msg);

  JsonObject& root = jsonBuffer.parseObject(msg);
  if (!root.success()) {
    Serial.println("Eroare la parsarea JSON-update_TRV_State");
    return;
  }
    String mesaj = root["state"];
    if (mesaj == "online"){
        //Serial.println("TRV2 online ");
        TRVState = true; 
      }
    if (mesaj == "offline"){
        //Serial.println("TRV2 offline ");
        TRVState = false;
      }
}

