eteodun/ESP32_Smart_Thermostat_3_Zones/ESP32_3_Zones.cpp
void handleTRVSTATUS(const char* topic,byte* payload, unsigned int length, bool& TRVSTATUS) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  DynamicJsonBuffer jsonBuffer;
  
  //Serial.print("Received payload: ");
  //Serial.println(msg);

  JsonObject& root = jsonBuffer.parseObject(msg);
  if (!root.success()) {
    Serial.println("Eroare la parsarea JSON-update_TRV_State");
    return;
  }
    String mesaj = root["state"];
    if (mesaj == "heatingon"){
        //Serial.println("TRV2 online ");
        TRVSTATUS = true; 
      }
    if (mesaj == "heatingoff"){
        //Serial.println("TRV2 offline ");
        TRVSTATUS = false;
      }
}
void handleTemperatureSensor(const char* topic, byte* payload, unsigned int length, float& temperatura) {
  DynamicJsonBuffer jsonBuffer;
  payload[length] = '\0';
  String msg = String((char*)payload);
  JsonObject& root = jsonBuffer.parseObject(msg);
  if (!root.success()) {
    Serial.println("Eroare la parsarea JSON-ului.");
    return;
  }
  // Verificăm dacă cheia "temperature" există în JSON și este un număr
  if (root.containsKey("temperature") && root["temperature"].is<float>()) {
    temperatura = root["temperature"];
  } else {
    Serial.println("Eroare: Cheia 'temperature' lipsește sau nu este un număr valid");
  }
}
void handleTargetTempRoom(const char* topic, byte* payload, unsigned int length, float& TargetTempRoom) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  TargetTempRoom = msg.toFloat();
}
void handleSenzor_name(const char* topic, byte* payload, unsigned int length, String& Senzor_name) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  Senzor_name = msg;
}
//Histerises handle
void handlehisterises(const char* topic, byte* payload, unsigned int length, float& histerises) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  histerises = msg.toFloat();
}
void handleRadiator(const char* topic, byte* payload, unsigned int length, bool& radiator) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  DynamicJsonBuffer jsonBuffer;
  JsonObject& root = jsonBuffer.parseObject(msg);
  if (!root.success()) {
    Serial.println("Eroare la parsarea JSON-ului_Bridge");
      return;
  }
  String mesaj = root["state"];
  if (mesaj == "on"){
  //Serial.println("Senzor_4 online ");
    radiator = true; 
  }
  if (mesaj == "off"){
     //Serial.println("Senzor_4 offline ");
    radiator = false;
  }
}
// boiler settings
void handleOVERTIMERUNNINGTIME(const char* topic, byte* payload, unsigned int length, long unsigned& OVERTIMERUNNINGTIME) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  OVERTIMERUNNINGTIME = msg.toInt();
}

void handleIntervalRunningTIME(const char* topic, byte* payload, unsigned int length, long unsigned& INTERVALRUNNINGTIME) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  INTERVALRUNNINGTIME = msg.toInt();
}

void handleIntervalRunningPauseTIME(const char* topic, byte* payload, unsigned int length, long unsigned& INTERVALPAUSETIME) {
  payload[length] = '\0';
  String msg = String((char*)payload);
  INTERVALPAUSETIME = msg.toInt();
}
///
void ActuateHeating(bool demand) {
  unsigned long currentMillis = millis();
  if (OverTime == "OFF") {
    ///unsigned long intervalMillisOn = intervalRunningOn * 60 * 1000UL; //transformam in minute
    ///unsigned long intervalMillisOff = intervalRunningOff * 60 * 1000UL; 
    if (demand && !heatingActive && !pauseActive) {
      
      overrunning = true;
      // Porneste încălzirea
      RelayHeaterState = "ON";
      //Serial.println("Thermostat ON");
      digitalWrite(RelayPINHeater, HIGH);
      heatingActive = true;
      client.publish(MQTT_HEATING_STATE, String("heating").c_str(), true);
      previousMillis = currentMillis;  // Actualizează timpul ultimei acțiuni
    }

    if (heatingActive && currentMillis - previousMillis >= intervalRunningOn * 60 * 1000UL) {
      // Oprește încălzirea după 15 secunde și pregătește pauza
      RelayHeaterState = "OFF";
      //Serial.println("Thermostat OFF");
      digitalWrite(RelayPINHeater, LOW);
      heatingActive = false;
      pauseActive = true;
      client.publish(MQTT_HEATING_STATE, String("notHeating").c_str(), true);
      previousMillis = currentMillis;  // Actualizează timpul ultimei acțiuni
    }

    if (pauseActive && currentMillis - previousMillis >= intervalRunningOff * 60 * 1000UL) {
      // Porneste încălzirea din nou după 10 secunde de pauză și resetează variabilele
      RelayHeaterState = "ON";
      //Serial.println("Thermostat ON");
      digitalWrite(RelayPINHeater, HIGH);
      heatingActive = true;
      pauseActive = false;
      client.publish(MQTT_HEATING_STATE, String("heating").c_str(), true);
      previousMillis = currentMillis;  // Actualizează timpul ultimei acțiuni
     }
    } 
    else {
    // Dacă OverTime nu este "OFF", dezactivează încălzirea și resetează variabilele
    RelayHeaterState = "OFF";
    Serial.println("OverRunning Active");
    digitalWrite(RelayPINHeater, LOW);
    heatingActive = false;
    pauseActive = false;
    client.publish(MQTT_HEATING_STATE, String("notHeating").c_str(), true);    
    previousMillis = currentMillis;  // Actualizează timpul ultimei acțiuni
    overrunning = false;
  }
      // Oprirea încălzirii când demand devine false
    if (!demand && heatingActive) {
    RelayHeaterState = "OFF";
    //Serial.println("Thermostat OFF");
    digitalWrite(RelayPINHeater, LOW);
    heatingActive = false;
    pauseActive = false;
    client.publish(MQTT_HEATING_STATE, String("notHeating").c_str(), true);
    previousMillis = currentMillis;  // Actualizează timpul ultimei acțiuni
  }
}
//
void actuateHeating(int relayPin, const char* mqttTopic, bool demand, String& relayState,bool trvstatus1) {
  if (OverTime == "OFF") {
    pinMode(relayPin, OUTPUT);
    
    if (demand) {  
      relayState = "ON";
      if(trvstatus1){
      digitalWrite(relayPin, HIGH);
      }
      ///client.publish(mqttTopic, String(TRVON).c_str(), true);
      client.publish(mqttTopic, String("ON").c_str(), true);
      //client.publish(mqttTopic, String(TRVTARGET).c_str(), true);
      //Serial.println("relayState ON");
    } 
    else {
      relayState = "OFF";
      //Serial.println("OverRunning OFF");
      digitalWrite(relayPin, LOW);
      //client.publish(mqttTopic, String(TRVOFF).c_str(), true);
      client.publish(mqttTopic, String("OFF").c_str(), true);
    }
  } else {
    Serial.println("relayState =  OFF");
    relayState = "OFF";
    digitalWrite(relayPin, LOW);
    //client.publish(mqttTopic, String(TRVOFF).c_str(), true);
    client.publish(mqttTopic, String("OFF").c_str(), true);
  }
}
void ActuateHeating1(bool demand) {
  actuateHeating(RelayPIN1, mqtt_topic_TRV_setting_zone1, demand, RelayState1, TRV1STATUS);
}

void ActuateHeating2(bool demand) {
  actuateHeating(RelayPIN2, mqtt_topic_TRV_setting_zone2, demand, RelayState2, TRV2STATUS);
}

