eteodun/ESP32_Smart_Thermostat_3_Zones/ESP32_3_Zones.cpp
void ActuateHeating3(bool demand) {
  actuateHeating(RelayPIN3, mqtt_topic_TRV_setting_zone3, demand, RelayState3, TRV3STATUS);
}
///
void callback(char* topic, byte* payload, unsigned int length) { 
  payload[length] = '\0';
  String msg = String((char*)payload);
  String msg1 = String((char*)payload);
  //String msg1 = String((char*)payload);
  // Check TRV status 
  if (strcmp(topic, mqtt_topic_TRV_status_zone1) == 0) {
  updateTRVState(mqtt_topic_TRV_status_zone1, payload, length, TRV1);
  }
  else if (strcmp(topic, mqtt_topic_TRV_status_zone2) == 0) {
  updateTRVState(mqtt_topic_TRV_status_zone2, payload, length, TRV2);
  }
  else if (strcmp(topic, mqtt_topic_TRV_status_zone3) == 0) {
  updateTRVState(mqtt_topic_TRV_status_zone3, payload, length, TRV3);
  }
  else if  (strcmp(topic, mqtt_topic_TRV_mode_zone1) == 0) {
  handleTRVSTATUS(mqtt_topic_TRV_mode_zone1, payload, length, TRV1STATUS);
  }
  else if (strcmp(topic, mqtt_topic_TRV_mode_zone2) == 0) {
  handleTRVSTATUS(mqtt_topic_TRV_mode_zone2, payload, length, TRV2STATUS);
  }
  else if (strcmp(topic, mqtt_topic_TRV_mode_zone3) == 0) {
  handleTRVSTATUS(mqtt_topic_TRV_mode_zone3, payload, length, TRV3STATUS);
  }
  // Maintenance radiators
  else if (strcmp(topic, mqtt_topic_maintenance_radiator_1) == 0) {
  handleRadiator(mqtt_topic_maintenance_radiator_1, payload, length, radiator_1);
  }
  else if (strcmp(topic, mqtt_topic_maintenance_radiator_2) == 0) {
  handleRadiator(mqtt_topic_maintenance_radiator_2, payload, length, radiator_2);
  }  
  else if (strcmp(topic, mqtt_topic_maintenance_radiator_3) == 0) {
  handleRadiator(mqtt_topic_maintenance_radiator_3, payload, length, radiator_3);
  } 
  else if (strcmp(topic, MQTT_BRIDGE_STATE) == 0) {
     DynamicJsonBuffer jsonBuffer;
     JsonObject& root = jsonBuffer.parseObject(msg);
      if (!root.success()) {
      Serial.println("Eroare la parsarea JSON-ului_Bridge");
      return;
    }
    String mesaj = root["state"];
    if (mesaj == "online"){
        //Serial.println("Senzor_4 online ");
        bridgeState = true; 
      }
    if (mesaj == "offline"){
        //Serial.println("Senzor_4 offline ");
        bridgeState =  false;
      }

  }
  //temperature
  else if (strcmp(topic, mqtt_topic_temp_zone1) == 0) {
    handleTemperatureSensor(mqtt_topic_temp_zone1, payload, length, Temperature1mqtt);
  } 
  else if (strcmp(topic, mqtt_topic_temp_zone2) == 0) {
    handleTemperatureSensor(mqtt_topic_temp_zone2, payload, length, Temperature2mqtt);
  } 
  else if (strcmp(topic, mqtt_topic_temp_zone3) == 0) {
    handleTemperatureSensor(mqtt_topic_temp_zone3, payload, length, Temperature3mqtt);
  }
  //target
  else if (strcmp(topic, mqtt_topic_target_temp_zone1) == 0) {
    handleTargetTempRoom(mqtt_topic_target_temp_zone1, payload, length, TargetTempRoom1);
  }
  else if (strcmp(topic, mqtt_topic_target_temp_zone2) == 0) {
    handleTargetTempRoom(mqtt_topic_target_temp_zone2, payload, length, TargetTempRoom2);
  }
  else if (strcmp(topic, mqtt_topic_target_temp_zone3) == 0) {
    handleTargetTempRoom(mqtt_topic_target_temp_zone3, payload, length, TargetTempRoom3);
  }
  // histerises upper 
  else if (strcmp(topic, mqtt_boiler_histeresis_upper) == 0) {
    handlehisterises(mqtt_boiler_histeresis_upper, payload, length, histeresisup);
  }
  // histerises down 
  else if (strcmp(topic, mqtt_boiler_histeresis_down) == 0) {
    handlehisterises(mqtt_boiler_histeresis_down, payload, length, histeresisdown);
  }  
// Sensor_Name
  else if (strcmp(topic, mqtt_topic_name_zone1) == 0) {
    handleSenzor_name(mqtt_topic_name_zone1, payload, length, Senzor1_name);
  }
  else if (strcmp(topic, mqtt_topic_name_zone2) == 0) {
    handleSenzor_name(mqtt_topic_name_zone2, payload, length, Senzor2_name);
  }
  else if (strcmp(topic, mqtt_topic_name_zone3) == 0) {
    handleSenzor_name(mqtt_topic_name_zone3, payload, length, Senzor3_name);
  }
  ///
  else if (strcmp(topic, MQTT_SENSOR_CORRECTION_INTERNAL) == 0) {
     correction_internal = msg1.toFloat();
     //Serial.print("TargetTempRoom1: ");
     //Serial.println(TargetTempRoom1);
  }
  // boiler settings
  else if (strcmp(topic, mqtt_boiler_overruning_time) == 0) {
    handleOVERTIMERUNNINGTIME(mqtt_boiler_overruning_time, payload, length, OVERTIME_RUNNING);
  }
  else if (strcmp(topic, mqtt_boiler_running_time) == 0) {
    handleIntervalRunningTIME(mqtt_boiler_running_time, payload, length, intervalRunningOn);
  }
  else if (strcmp(topic, mqtt_boiler_pause_time) == 0) {
    handleIntervalRunningPauseTIME(mqtt_boiler_pause_time, payload, length, intervalRunningOff);
  }
/// Define maintenance mode
  else if (strcmp(topic, mqtt_topic_maintenance) == 0) {
     DynamicJsonBuffer jsonBuffer;
     JsonObject& root = jsonBuffer.parseObject(msg);
      if (!root.success()) {
      Serial.println("Eroare la parsarea JSON-ului_Bridge");
      return;
    }
    String mesaj = root["state"];
    if (mesaj == "on"){
        //Serial.println("Senzor_4 online ");
        maintenance = true; 
      }
    if (mesaj == "off"){
        //Serial.println("Senzor_4 offline ");
        maintenance = false;
        ActuateHeating(OFF);
        ActuateHeating1(OFF);
        ActuateHeating2(OFF);
        ActuateHeating3(OFF);
      }
  }
  // Define HVAC MODE
  else if (strcmp(topic, MQTT_HVAC_MODE) == 0) {
     DynamicJsonBuffer jsonBuffer;
     JsonObject& root = jsonBuffer.parseObject(msg);
      if (!root.success()) {
      Serial.println("Eroare la parsarea JSON-ului_Bridge");
      return;
    }
    String mesaj = root["state"];
    if (mesaj == "heatingon"){
        Serial.println("hvacmode  on ");
        hvacmode = true; 
      }
    if (mesaj == "heatingoff"){
        Serial.println("hvacmode off ");
        hvacmode = false;
      }
  }
    // Reset overruning state
  else if (strcmp(topic, MQTT_OVERRUNNING_RESET_TOPIC) == 0) {
     DynamicJsonBuffer jsonBuffer;
     JsonObject& root = jsonBuffer.parseObject(msg);
      if (!root.success()) {
      Serial.println("Eroare la parsarea JSON-ului_Bridge");
      return;
      }
    String mesaj = root["state"];
    if (mesaj == "reset"){
        //Serial.println("Senzor_1 online ");
        OverTime = "OFF";
        Serial.println("Overrunning reset"); 
      }
    } 
  else if (strcmp(topic, mqtt_topic_manual_heating) == 0) {
     DynamicJsonBuffer jsonBuffer;
     JsonObject& root = jsonBuffer.parseObject(msg);
      if (!root.success()) {
      Serial.println("Eroare la parsarea JSON-ului_Bridge");
      return;
    }
    String mesaj = root["state"];
    if (mesaj == "on"){
        //Serial.println("Senzor_4 online ");
        manual_heating = true; 
      }
    if (mesaj == "off"){
        manual_heating = false;
      }
  }
}

/// END CALLBACK

