eteodun/ESP32_Smart_Thermostat_3_Zones/ESP32_3_Zones.cpp
// define void maintenace_on
void maintenace_on() {
  if (maintenance) {
    //Serial.println("Maintenance_ON");
    //ActuateHeating(OFF);

    if (radiator_1) ActuateHeating1(ON);
    if (radiator_2) ActuateHeating2(ON);
    if (radiator_3) ActuateHeating3(ON);
    if (manual_heating) ActuateHeating(ON);

    if (!radiator_1) ActuateHeating1(OFF);
    if (!radiator_2) ActuateHeating2(OFF);
    if (!radiator_3) ActuateHeating3(OFF);
    if (!manual_heating) ActuateHeating(OFF);
  } 

}


void alarmsystem(){
if (areAllTRVsOn) {
  Serial.println("Toți senzorii și toate TRV-urile sunt online");
} else {
  for (int sensorNumber = 1; sensorNumber <= 3; ++sensorNumber) {
    bool currentSensorState;

    switch (sensorNumber) {
      case 1:
        currentSensorState = TRV1;
        break;
      case 2:
        currentSensorState = TRV2;
        break;
      case 3:
        currentSensorState = TRV3;
        break;
        break;
      default:
        currentSensorState = false; // O valoare implicită în cazul unui număr de senzor necunoscut
    }

    if (!currentSensorState) {
      Serial.print("Senzorul ");
      Serial.print(sensorNumber);
      Serial.println(" nu este online");
    }
  }

  if (!TRV1) {
    Serial.println("TRV1 nu este online");
  }
  if (!TRV2) {
    Serial.println("TRV2 nu este online");
  }
  if (!TRV3) {
    Serial.println("TRV3 nu este online");
  }
  if (!bridgeState) {
    Serial.println("Zigbee nu este online");
  }
 } 
}
//


void checkRoom(float roomTemp, float targetTemp, bool trv, unsigned long &lowTempSensorTime, unsigned long &lowLastReadTime, void (&actuateHeating)(bool), bool trvstatus, float histeresisdown) {
  if (roomTemp < targetTemp - histeresisdown && OverTime == "OFF" && roomTemp != 0 && trv) {
    //Serial.println("apelare checkRoom");
    lowTempSensorTime += millis() - lowLastReadTime;
    lowLastReadTime = millis();
    if (lowTempSensorTime >= TIME_SENSOR * 1000) {
      actuateHeating(ON);
      if(trvstatus){
        ActuateHeating(ON);
      }
    }
  } else {
    lowTempSensorTime = 0;
    lowLastReadTime = millis();
  }
}

void checkHighTempSensor(float roomTemp, float targetTemp, unsigned long &highTempSensorTime, unsigned long &highLastReadTime, void (&actuateHeating)(bool), bool trv, float histeresisup) {
  if (roomTemp > targetTemp + histeresisup || !trv ) {
    //Serial.println("apelare checkHighTempSensor");
    highTempSensorTime += millis() - highLastReadTime;
    highLastReadTime = millis();
    if (highTempSensorTime >= TIME_SENSOR * 1000) {
      actuateHeating(OFF);
    }
  } else {
    highTempSensorTime = 0;
    highLastReadTime = millis();
  }
}

void checkAllRelays() {
  if ((RelayState1 == "OFF" || !bridgeState || MQTT_CONNECT == "OFF") && (RelayState2 == "OFF" || !bridgeState || MQTT_CONNECT == "OFF") && (RelayState3 == "OFF" || !bridgeState || MQTT_CONNECT == "OFF")) {
    //Serial.println("apelare checkAllRelays");
    ActuateHeating(OFF);
    OverTime = "OFF";
    overrunning = false;
  }
}
void controlheat() {
  //unsigned long currentMillis = millis();
  //Serial.println("apelare controlheat");
  checkRoom( Temperature1, TargetTempRoom1, TRV1, lowTempSensorTime1, lowlastReadTime1, ActuateHeating1, TRV1STATUS, histeresisdown);
  checkRoom( Temperature2, TargetTempRoom2, TRV2, lowTempSensorTime2, lowlastReadTime2, ActuateHeating2, TRV2STATUS, histeresisdown);
  checkRoom( Temperature3, TargetTempRoom3, TRV3, lowTempSensorTime3, lowlastReadTime3, ActuateHeating3, TRV3STATUS, histeresisdown);

  checkHighTempSensor(Temperature1, TargetTempRoom1, highTempSensorTime1, highlastReadTime1, ActuateHeating1, TRV1, histeresisup);
  checkHighTempSensor(Temperature2, TargetTempRoom2, highTempSensorTime2, highlastReadTime2, ActuateHeating2, TRV2, histeresisup);
  checkHighTempSensor(Temperature3, TargetTempRoom3, highTempSensorTime3, highlastReadTime3, ActuateHeating3, TRV3, histeresisup);

  checkAllRelays();
}

void hvacmodevoid() {
  if (hvacmode && !maintenance) { 
   controlheat();
   //Serial.println("hvacmodevoid este ON");
  }
 else if (!hvacmode && !maintenance) {
  //Serial.println("hvacmodevoid este OFF");
  ActuateHeating(OFF);
  ActuateHeating1(OFF);
  ActuateHeating2(OFF);
  ActuateHeating3(OFF);
  overrunning = false;
  OverTime = "OFF";
  }
}
void OverRunning() {
  if (!maintenance){
  unsigned long currentMillis = millis();
  if (overrunning) {
   // Serial.println("ActuateHeating este ON");
   // Increment a counter variable
    ///unsigned long overRuningMillis = OVERTIME_RUNNING * 60 * 1000UL; //transformam in minute
    overRunningTime += currentMillis - overRunningLastReadTime;  // Increment by the time elapsed since the last reading
    overRunningLastReadTime = currentMillis;  // Update the last read time
    // Check if the counter variable has reached 15 minutes (900,000 milliseconds)
    if (overRunningTime >= OVERTIME_RUNNING * 60 * 1000UL){    // Time in minutes
      //Serial.println("A mers prea mult!");
      OverTime = "ON";
      ActuateHeating(OFF);
    }
  }

else {
    // Reset the counter variable if the analog value falls below the threshold
    overRunningTime = 0;
    overRunningLastReadTime = currentMillis;  // Update the last read time
    //Serial.println("Resetam OverRunning");
  }
 }
}
void system_alarm() {
  pinMode(PINAlarm, OUTPUT);

  if (Temperature1 == 0.00 || Temperature2 == 0.00 || Temperature3 == 0.00 || TempInternal == 0.00 ||
     !bridgeState || !TRV1 || !TRV2 || !TRV3 || OverTime == "ON") {
    digitalWrite(PINAlarm, HIGH);
    SytemAlarm = "ON";
  } else {
    digitalWrite(PINAlarm, LOW);
    SytemAlarm = "OFF";
  }
}

void publishData(float p_temperatureintern) {
  // create a JSON object
  // doc : https://github.com/bblanchon/ArduinoJson/wiki/API%20Reference
  StaticJsonBuffer<200> jsonBuffer;
  JsonObject& root = jsonBuffer.createObject();
  // INFO: the data must be converted into a string; a problem occurs when using floats...
  root["TempInternal"] = (String)p_temperatureintern;
  //root["temperature2"] = (String)p_temperature2;
  //root["temperature3"] = (String)p_temperature3;
  //root.prettyPrintTo(Serial);
  //Serial.println("");
  /*
     {
        "temperature": "23.20" ,
        "humidity": "43.70"
     }
  */
  char data[200];
  root.printTo(data, root.measureLength() + 1);
  client.publish(MQTT_SENSOR_INTERNAL, data, true);
  yield();
}

void readsensor(){
  float temperature = dht.readTemperature();

