eteodun/ESP32_Smart_Thermostat_3_Zones/ESP32_3_Zones.cpp
  // Check if any reads failed and exit early (to try again).
  if (isnan(temperature)) {
    Serial.println(F("Failed to read from DHT sensor!"));
    //temperature = 0;
    return;
  }

  TempInternal = temperature;
  TempInternal = TempInternal + (correction_internal);
  /*
  Vo = analogRead(sensorInternal);
  R2 = R1 * (1023.0 / (float)Vo - 1.0);
  logR2 = log(R2);
  T = (1.0 / (c1 + c2*logR2 + c3*logR2*logR2*logR2));
  TempInternal = T - 273.15;
  TempInternal = TempInternal + (correction1);
   
  TempInternal = 1 / (log(1 / (1023. / analogRead(sensorInternal) - 1)) / BETA + 1.0 / 298.15) - 273.15;
  TempInternal = TempInternal + (correction1);
  ///
  double temp = Thermister(analogRead(sensorInternal));  // Read sensor
  TempInternal = temp + (correction1);
  */
}

void printtemp(){
  Serial.print("Temperature_1 " + String(Senzor1_name) + ": ");
  Serial.print(Temperature1);
  Serial.println((" °C"));
  Serial.print("Temperature_2 " + String(Senzor2_name) + ": ");
  Serial.print(Temperature2);
  Serial.println((" °C"));
  Serial.print("Temperature_3 " + String(Senzor3_name) + ": ");
  Serial.print(Temperature3);
  Serial.println((" °C"));
  Serial.print("TempInternal : ");
  Serial.print(TempInternal);
  Serial.println((" °C"));
// print target temp  
  Serial.print("Target 1 " + String(Senzor1_name) + ": ");
  Serial.print(TargetTempRoom1);
  Serial.println((" °C"));
  Serial.print("Target 2 " + String(Senzor2_name) + ": ");
  Serial.print(TargetTempRoom2);
  Serial.println((" °C"));
  Serial.print("Target 3 " + String(Senzor3_name) + ": ");
  Serial.print(TargetTempRoom3);
  Serial.println((" °C"));
}

void loop () {
  
  unsigned long currentMillis = millis();  // folosim sa luam ceasul actual intern
  reconnect(); //folosim fara delay in caz ca se deconecteaza
  client.loop();  //folosim fara delay
  if (currentMillis - previousMillis1  >= SAMPLE_LOOP_TIME1 * 1000) { 
    previousMillis1  = millis();
  //alarmsystem();
    printtemp();
    readsensor();
    publishData(TempInternal);
    ArduinoOTA.handle();   
  }
  if (currentMillis - previousMillis2 >=  SAMPLE_LOOP_TIME2 * 1000) {
    previousMillis2 = millis();
    checkSensor();
    StartUp_ESP();
    client.publish(MQTT_OVERRUNNING_TOPIC, String(OverTime).c_str(), true);    
  }
  if (currentMillis - previousMillis3 >=  SAMPLE_LOOP_TIME3 * 1000) {
    previousMillis3 = millis(); 
    client.publish(status_esp_keepalive, String("online").c_str(), true);
    system_alarm();
    alarmsystem();
    
  }
  if (currentMillis - previousMillis4 >=  SAMPLE_LOOP_TIME4 * 1000) {
    previousMillis4  = millis();
    OverRunning();
    hvacmodevoid();
 
    //controlheat();
    maintenace_on();
    
  }
  if (restartNow){
    Serial.println("Restart");
    ESP.restart();
  }
  yield();
}
String WiFiSignal() {
  float Signal = WiFi.RSSI();
  Signal = 90 / 40.0 * Signal + 212.5;
  if (Signal > 100) Signal = 100;
  return " " + String(Signal, 0) + "%";
}
// Function for upload firmware file via webpage
static void handle_update_progress_cb(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
  uint32_t free_space = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
  if (!index){
    Serial.println("Update");
    Update.runAsync(true);
    if (!Update.begin(free_space)) {
      Update.printError(Serial);
    }
  }

  if (Update.write(data, len) != len) {
    Update.printError(Serial);
  }

  if (final) {
    if (!Update.end(true)){
      Update.printError(Serial);
    } else {
      restartNow = true;//Set flag so main loop can issue restart call
      Serial.println("Update complete");
    }
  }
}
///Function called to reboot system
void RebootSystem() {
  restartNow = true;
}
// Function called to delete wifi data 
void handleWiFiReset(){
  wifiManager.resetSettings();
}
///
//######################### HTTP section
// Header page and style
void append_HTML_header(bool refreshMode) {
  webpage = "<!DOCTYPE html>";
  webpage += "<html lang=\"en\">";
  webpage += "<head>";
  webpage += "<meta charset=\"UTF-8\">";
  webpage += "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">";
  webpage += "<title>SmartThermostat</title>";
   if (refreshMode) webpage += F("<meta http-equiv='refresh' content='15'>");
  webpage += "<style>";
  webpage += "	   body {font-family: Arial, Helvetica,display: flex; justify-content: center; align-items: center; sans-serif;  margin: 0;}";
  webpage += "	   table tr, td     {padding:0.2em 0.5em 0.2em 0.5em;font-size:1.0em;font-family:Arial,Helvetica,sans-serif;text-align:center;}";
  webpage += "h2               {margin-top:0.3em;margin-bottom:0.3em;font-size:1.4em;text-align:center;}";
  webpage += "h3               {margin-top:0.3em;margin-bottom:0.3em;font-size:1.2em;text-align:center;}";
  webpage += "h4               {margin-top:0.3em;margin-bottom:0.3em;font-size:0.8em;}";
  webpage += ".centre          {margin-left:auto;margin-right:auto;text-align:right;}";
  webpage += "table.timer tr {padding:0.2em 0.5em 0.2em 0.5em;font-size:1.1em;font-family:Arial,Helvetica,sans-serif;blue;border: 1px solid black;}";
  webpage += "table.timer td {padding:0.2em 0.5em 0.2em 0.5em;font-size:1.1em;font-family:Arial,Helvetica,sans-serif;blue;border: 1px solid black;}";
  //  webpage += "	   col:first-child  {background:lightcyan}col:nth-child(2){background:#CCC}col:nth-child(8){background:#CCC}";
  // webpage += "	   tr:first-child   {background:lightcyan}";
  webpage += ".navbar {  overflow: hidden;  background-color: #333;}";
  webpage += ".navbar a {float: left;font-size: 16px;  color: white;  text-align: center;  padding: 14px 16px;  text-decoration: none;}";
  webpage += ".subnav {  float: left;  overflow: hidden;}";
  webpage += ".subnav .subnavbtn {  font-size: 16px;border: none;  outline: none;  color: white;  padding: 14px 16px;  background-color: inherit;  font-family: inherit;  margin: 0;}";
  webpage += ".navbar a:hover, .subnav:hover .subnavbtn {  background-color: red;}";
  webpage += ".subnav-content {  display: none;position: absolute;  left: 0;  background-color: red;  width: 100%;  z-index: 1;}";
  webpage += ".subnav-content a {  float: left;color: white;  text-decoration: none;}";
  webpage += ".subnav-content a:hover {  background-color: #eee;  color: black;}";
  webpage += ".subnav:hover .subnav-content {  display: block;}";
  webpage += "	   table.tabela1  {font-family: Arial, Helvetica, sans-serif; width:auto;margin-left:left;margin-right:auto;}";
  webpage += "	  .tabela1 th {border: 2px solid black;border-radius: 10px;padding:0.2em 0.5em 0.2em 0.5em; text-align:center;width:auto;}";
  webpage += "	   table.tabela2  {font-family: Arial, Helvetica, sans-serif;width:auto;margin-left:auto;margin-right:auto;}";
  webpage += "	  .tabela2 th {border:2px solid black;border-radius: 10px;padding:0.2em 0.5em 0.2em 0.5em;font-size:1.0em;background-color:lightgray;text-align:center;width:auto;}";
  webpage += "	   table.tabela3  {font-family: Arial, Helvetica, sans-serif;width:auto;margin-left:auto;margin-right:auto;}";
  webpage += "	  .tabela3 th {border: 2px solid black;border-radius: 10px;padding:0.2em 0.5em 0.2em 0.5em;background-color:lightgray;text-align:center;width:auto;}";
  webpage += "	  .tabela3 td  {border-radius: 10px;padding:0.2em 0.5em 0.2em 0.5em;text-align:center;color:#f2f2f2}";
  webpage += "	   table.tabela4  {font-family: Arial, Helvetica, width:auto; margin-left:auto;margin-right:auto;}";
  webpage += "	  .tabela4 th {border: 2px solid black;border-radius: 10px;padding:0.2em 0.5em 0.2em 0.5em;background-color:lightgray;text-align:center;width:auto;}";
  webpage += "    .onthermostat   {width:20%;color:red;}";
  webpage += "    .offthermostat  {width:20%;color:green;}";
  webpage += ".tabela1 .on {background-color: red;}";
  webpage += ".tabela1 .off {background-color: limegreen;}";
  webpage += ".tabela1 .faulton {background-color: lightgray;}";
  webpage += ".tabela3 .on {background-color: #EC8B36;}";
  webpage += ".tabela3 .off {background-color: #B0DC84;}";
  webpage += ".tabela4 .on {background-color: #EC8B36;}";
  webpage += ".tabela4 .off {background-color: #B0DC84;}";
  // define footer style
  webpage += "footer           {padding:0.08em;background-color:#000;font-size:1.1em;text-align: center;position: fixed; bottom: 0;  width: 100%;color:white;}";
  webpage += ".medium          {font-size:1.4em;padding:0;margin:0}";
  webpage += ".ps              {font-size:0.7em;padding:0;margin:0}";
  webpage += "</style>";
  webpage += "</head>";
  webpage += "<body>";
  webpage += "<div class=\"navbar\">";
  webpage += "<a href=\"homepage\">Home</a>";
  webpage += "<div class=\"subnav\">";
  webpage += "<button class=\"subnavbtn\">System<i class=\"fa fa-caret-down\"></i></button>";
  webpage += "<div class=\"subnav-content\">";
  webpage += "<a href=\"sysinfo\">System-Info</a>";
  webpage += "<a href=\"systemreboot\">Sytem Reboot</a>";
  webpage += "<a href=\"softwareupgrade\">Software Upgrade</a>";
  webpage += "<a href=\"resetwifi\">WiFi-Data-Reset</a>";
  webpage += "</div>";
  webpage += "</div> ";
  webpage += "</div>";
}
void append_HTML_footer() {
  webpage += "<!-- AICI este bara de jos-->";
  webpage += "<footer>";
  webpage += "<p class='medium'>WiFi Smart Thermostat</p>";
  webpage += "<p class='ps'><i>Copyright &copy; Teodoran_Duna</i></p>";
  webpage += "</footer>";
  webpage += "</body></html>";
}

void SysInfo() {
  append_HTML_header(noRefresh);
  webpage += "<h3>Sytem Information</h3><br> ";
  webpage += "<table class=\"centre timer\"> ";
  webpage += "<tr> ";
  webpage += "<td>Data</td><td>Value</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>SW Version: </td>";
  webpage += "<td>" + String(sw_version) + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>Model Type: </td>";
  webpage += "<td>" + String(model) + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>WiFi SSID: </td>";
  webpage += "<td>" + String(WiFi.SSID()) + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>IP Address: </td>";
  webpage += "<td>" + WiFi.localIP().toString() + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>WiFi Signal: </td> ";
  webpage += "<td>" + WiFiSignal() + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>HAS Hostname: </td>";
  webpage += "<td>" + String(mqtt_server) + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>HAS IP: </td>";
  webpage += "<td>" + String(serverIP.toString().c_str()) + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>MQTT User: </td>";
  webpage += "<td>" + String(mqtt_user) + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>MQTT PASS: </td> ";
  webpage += "<td>" + String(mqtt_password) + "</td>";
  webpage += "</tr> ";
  webpage += "<tr> ";
  webpage += "<td>Running Time (min): </td> ";
  webpage += "<td>" + String(intervalRunningOn) + "</td>";
  webpage += "</tr> ";
  webpage += "<td>Pause Time (min): </td> ";
  webpage += "<td>" + String(intervalRunningOff) + "</td>";
  webpage += "</tr> ";
  webpage += "<td>OverRunning Time (min): </td> ";
  webpage += "<td>" + String(OVERTIME_RUNNING) + "</td>";
  webpage += "</tr> ";
 // histerises 
  webpage += "<td>Histerises upper limit: </td> ";
  webpage += "<td>" + String(histeresisup) + "</td>";
  webpage += "</tr> ";
   webpage += "<td>Histerises lower limit: </td> ";
  webpage += "<td>" + String(histeresisdown) + "</td>";
  webpage += "</tr> ";
// Test histeresis
  webpage += "<td>Histerises upper target: </td> ";
  webpage += "<td>" + String(TargetTempRoom1 + histeresisup) + "</td>";
  webpage += "</tr> ";
   webpage += "<td>Histerises lower target: </td> ";
  webpage += "<td>" + String(TargetTempRoom1 - histeresisdown) + "</td>";
  webpage += "</tr> ";
  webpage += "</table>";
  append_HTML_footer();
}
// Sytem reboot webpage
void SytemReboot() {
    append_HTML_header(noRefresh);
    webpage += "<div style='text-align: center;'>"; // Centrarea textului
    webpage += "<h3>Press Reboot Button to restart system</h3>";
    webpage += "</div>";
    webpage += "<div style='text-align: center;'>"; // Centrarea butonului
    webpage += "<button onclick=\"RebootArduino()\">Reboot</button>";
    webpage += "<script>";
    webpage += "function RebootArduino() {";
    webpage += "  var xhr = new XMLHttpRequest();";
    webpage += "  xhr.open('GET', '/RebootSystemArduino', true);";
    webpage += "  xhr.send();";
    webpage += "  setTimeout(function() { window.location.href = '/homepage'; }, 10000);"; // Direcționare către pagina homepage după 10 secunde
    webpage += "}";
    webpage += "</script>";
    append_HTML_footer();
}
// Software upgrade page
void SoftwareUpgrade() {
    append_HTML_header(noRefresh);
    webpage += "<style>";
    webpage += "#uploadform { text-align: center; }"; // Aliniază formularul în centru
    webpage += "#fileupload { margin: 0 auto; display: block; }"; // Aliniază caseta de browse în centru
    webpage += "#submit { margin-top: 10px; }"; // Adaugă un spațiu între casetă și buton
    webpage += "</style>";
    webpage += "<h3>Please browse .bin file</h3>";
    webpage += "<form id=\"uploadform\" enctype=\"multipart/form-data\" method=\"post\" action=\"/upload\">";
    webpage += "<input id=\"fileupload\" name=\"inobinfile\" type=\"file\" />";
    webpage += "<input type=\"submit\" value=\"Submit\" id=\"submit\" />";
    webpage += "</form>";
    webpage += "<script>";
    webpage += "document.getElementById('uploadform').addEventListener('submit', function(event) {";
    webpage += "  event.preventDefault();"; // Oprire trimitere formular
    webpage += "  var xhr = new XMLHttpRequest();";
    webpage += "  xhr.open('POST', '/upload', true);";
    webpage += "  xhr.onload = function() {";
    webpage += "    if (xhr.status === 200) {";
    webpage += "      setTimeout(function() { window.location.href = '/homepage'; }, 10000);"; // Direcționare către pagina homepage după 10 secunde
    webpage += "    } else {";
    webpage += "      alert('Eroare la încărcare');"; // Afișare alertă în caz de eroare
    webpage += "    }";
    webpage += "  };";
    webpage += "  xhr.send(new FormData(this));"; // Trimitere fișier prin POST
    webpage += "});";
    webpage += "</script>";
    append_HTML_footer();
}


// Wifi data reset webpage
void WifiReset() {
  append_HTML_header(noRefresh);
  webpage += "<div style='text-align: center;'>"; // Centrarea textului
  webpage += "<h3>Press Reset Data Button to reset Wifi Credentials</h3>";
  webpage += "</div>";
  webpage += "<div style='text-align: center;'>"; // Centrarea butonului
  webpage += "<button onclick=\"ResetWifi()\">Reset Data</button>";
  webpage += "<script>";
  webpage += "function ResetWifi() {";
  webpage += "  window.location.href = '/homepage';";
  webpage += "  var xhr = new XMLHttpRequest();";
  webpage += "  xhr.open('GET', '/ResetWiFiData', true);";
  webpage += "  xhr.send();";
  webpage += "}";
  webpage += "</script>";
  append_HTML_footer();
}
// Home page
void Homepage() { 
  append_HTML_header(Refresh);
  webpage += "<br>";
  webpage += "<table class=\"tabela1\">";
  webpage += "<tr>";
  webpage += "<th class=" + String((SytemAlarm == "ON" ? "'on'>" : "'off'>")) + "System Alarm" + "</th>";
  webpage += "</tr>";
  webpage += "<tr>";
  webpage += "<th class=" + String((OverTime == "ON" ? "'on'>" : "'off'>")) + "OverRunning Alarm" + "</th>";
  webpage += "</tr>";
  webpage += "<th class=" + String((MQTT_CONNECT == "OFF" ? "'on'>" : "'off'>")) + "MQTT Server Alarm" + "</th>";
  webpage += "</tr>";
  webpage += "<th class=" + String((SensorsConnected == "OFF" ? "'on'>" : "'off'>")) + "Sensors Alarm" + "</th>";
  webpage += "</tr>";
  webpage += "</table>";
  webpage += "<br>";
  webpage += "<table class=\"tabela2\">";
  webpage += "<tr>";
  webpage += "<th>Temperature " + String(Senzor1_name) + ": " + String((Temperature1)) + " &deg;</th>";
  webpage += "<th>Temperature " + String(Senzor2_name) + ": " + String((Temperature2)) + " &deg;</th>";
  webpage += "<th>Temperature " + String(Senzor3_name) + ": " + String((Temperature3)) + " &deg;</th>";
  webpage += "</tr>";
  webpage += "<tr>";
  webpage += "<th>Target Temp " + String(Senzor1_name) + ": " + String((TargetTempRoom1)) + " &deg;</th>";
  webpage += "<th>Target Temp " + String(Senzor2_name) + ": " + String((TargetTempRoom2)) + " &deg;</th>";
  webpage += "<th>Target Temp " + String(Senzor3_name) + ": " + String((TargetTempRoom3)) + " &deg;</th>";
  webpage += "</tr>";
  webpage += "</table>";
  webpage += "<table class=\"tabela4\">";
  webpage += "<tr>";
  webpage += "<th>Internal sensor: " + String(TempInternal) + " &deg;</th>";
  webpage += "</tr>";
  webpage += "</table>";
  webpage += "<br>";
  webpage += "<br>";
  webpage += "<br>";
  webpage += "<table class=\"tabela3\">";
  webpage += "<tr class=\"tabela3\">";
  // radiator 1
  if ( TRV1STATUS)  {
    webpage +="<th class=\"on\"> Radiator " + String(Senzor1_name) + "</th>";
  } 
  else if (!TRV1STATUS) {
    webpage +="<th class=\"off\"> Radiator " + String(Senzor1_name) + "</th>";
  }
  if (!TRV1) {
    webpage +="<th class=\"faulton\"> Radiator " + String(Senzor1_name) + "</th>";
  }
// radiator 2
  if (TRV2STATUS)  {
    webpage +="<th class=\"on\"> Radiator " + String(Senzor2_name) + "</th>";
  } 
  else if (!TRV2STATUS) {
    webpage +="<th class=\"off\"> Radiator " + String(Senzor2_name) + "</th>";
  }
  if (!TRV2) {
    webpage +="<th class=\"faulton\"> Radiator " + String(Senzor2_name) + "</th>";
  }
  // radiator 3
  if (TRV3STATUS)  {
    webpage +="<th class=\"on\"> Radiator " + String(Senzor3_name) + "</th>";
  } 
  else if (!TRV3STATUS) {
    webpage +="<th class=\"off\"> Radiator " + String(Senzor3_name) + "</th>";
  }
  if (!TRV3) {
    webpage +="<th class=\"faulton\"> Radiator " + String(Senzor3_name) + "</th>";
  }
///webpage += "<th class=" + String((RelayState1 == "ON" ? "'on'>" : "'off'>")) + "Radiator " + String(Senzor1_name) +  "</th>";
///webpage += "<th class=" + String((RelayState2 == "ON" ? "'on'>" : "'off'>")) + "Radiator " + String(Senzor2_name) +  "</th>";
///webpage += "<th class=" + String((RelayState3 == "ON" ? "'on'>" : "'off'>")) + "Radiator " + String(Senzor3_name) +  "</th>";
//webpage += "<th>Radiator " + String(Senzor1_name) + "</th>";
//webpage += "<th>Radiator " + String(Senzor2_name) + "</th>";
//webpage += "<th>Radiator " + String(Senzor3_name) + "</th>";
  webpage += "</tr>";
  webpage += "</table>";
  webpage += "<br>";
  webpage += "<table class=\"tabela4\">";
  webpage += "<tr class=\"tabela4\">";
  webpage += "<th class=" + String((RelayHeaterState == "ON" ? "'on'>" : "'off'>")) + "Heating" +  "</th>";
  webpage += "</tr>";
  webpage += "</table>";
  ///webpage += "<FORM action=\"/handleroom\"> ";
  ///webpage += "<input  style=\"margin: 0;  position: absolute; left: 50%;  -ms-transform: translate(-50%, -50%);  transform: translate(-50%, -50%);\" type=\"submit\" value=\"Save data\"><br><br> ";
  ///webpage += "</form>";
  webpage += "</body>";
  webpage += "</html>";
  append_HTML_footer();
}
// Function to call webpages 
void serverInit(){
  server.on("/", HTTP_GET, [](AsyncWebServerRequest * request) {
    request->redirect("/homepage");       // Go to home page
  });
  server.on("/homepage", HTTP_GET, [](AsyncWebServerRequest * request) {
    Homepage();
    request->send(200, "text/html", webpage);
  });
  server.on("/sysinfo", HTTP_GET, [](AsyncWebServerRequest * request) {
  SysInfo();
    request->send(200, "text/html", webpage);
  });
  // Reboot system section
  server.on("/systemreboot", HTTP_GET, [](AsyncWebServerRequest * request) {
  SytemReboot();
    request->send(200, "text/html", webpage);
  });
  server.on("/RebootSystemArduino", HTTP_GET, [] (AsyncWebServerRequest *request) {
    // Apelează funcția Arduino dorită aici (myFunction())
    // De exemplu: myFunction();
    RebootSystem();
    request->send(200, "text/plain", "Funcția Arduino a fost apelată");
});
