eteodun/ESP32_Smart_Thermostat_3_Zones/ESP32_3_Zones.cpp
  //Firmware upload Webpage
  server.on("/softwareupgrade", HTTP_GET, [](AsyncWebServerRequest * request) {
  SoftwareUpgrade();
    request->send(200, "text/html", webpage);
  });
  //Firmware upload file 
  server.on("/upload", HTTP_POST, [](AsyncWebServerRequest *request){
      request->send(200);
    }, handle_update_progress_cb);
  //
//////////////////////////
  server.on("/resetwifi", HTTP_GET, [](AsyncWebServerRequest * request) {
  WifiReset();
    request->send(200, "text/html", webpage);
  });
  server.on("/ResetWiFiData", HTTP_GET, [] (AsyncWebServerRequest *request) {
    // Apelează funcția Arduino dorită aici (myFunction())
    // De exemplu: myFunction();
    handleWiFiReset(); 
    request->send(200, "text/plain", "Funcția Arduino a fost apelată");
});

// Error page , not found
  server.onNotFound([](AsyncWebServerRequest *request){
    request->send(404);
  });
  server.begin();
}

void setup() {
  Serial.begin(115200);
  //Setup_wifi();
  pinMode(PINWifi, OUTPUT);
  pinMode(RelayPIN1, OUTPUT);
  pinMode(RelayPIN2, OUTPUT);
  pinMode(RelayPIN3, OUTPUT);
  pinMode(RelayPINHeater, OUTPUT);
  digitalWrite(RelayPINHeater, LOW);
  digitalWrite(RelayPIN1, LOW);
  digitalWrite(RelayPIN2, LOW);
  digitalWrite(RelayPIN3, LOW);
  pinMode(LED, OUTPUT);
  digitalWrite(LED, HIGH); 
  AsyncWiFiManager wifiManager(&server,&dns);
  wifiManager.autoConnect("SmartThermostatAP");
  serverInit();
  // Start find HA IP 
  if (WiFi.hostByName(mqtt_server, serverIP)) {
      Serial.print("IP address of ");
      Serial.print(mqtt_server);
      Serial.print(": ");
      Serial.println(serverIP);
  } else {
      Serial.println("Failed to get IP address from DNS");
  }
  if (WiFi.status() == WL_CONNECTED) {
    digitalWrite(PINWifi, HIGH);
  }
  else {
    digitalWrite(PINWifi, LOW);    
  }
  //Serial.print(host);
  //Serial.print(": ");
  //Serial.println(serverIP);
  // end find HA IP 
  client.setServer(mqtt_server, 1883);
  client.setCallback(callback);
  //Define relay pins
  dht.begin();
  client.publish(MQTT_STARTUP_STATE, String("started").c_str(), false);

  /// OTA definition
    ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else {  // U_FS
      type = "filesystem";
    }

    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    Serial.println("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      Serial.println("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      Serial.println("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      Serial.println("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      Serial.println("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      Serial.println("End Failed");
    }
  });
  ArduinoOTA.setHostname("ESP_1");
  ArduinoOTA.begin();
  // END OTA
  // publish local ip 
  Serial.println("Ready");
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());
  // Set hostname of ESP
  SetupDeviceName(ServerName); // Used to setup ESP hostname
  publishIP(); // Used to publish  ESP IP 

}
